benchmarks/fio_nvme_latency_checks/output/randread.out
seqwrite: (g=0): rw=write, bs=32K-32K/32K-32K/32K-32K, ioengine=libaio, iodepth=1
...
fio-2.2.10
Starting 4 processes
Jobs: 4 (f=3): [W(4)] [100.0% done] [0KB/1154MB/0KB /s] [0/36.1K/0 iops] [eta 00m:00s]
seqwrite: (groupid=0, jobs=4): err= 0: pid=2091: Thu Jul  2 23:24:01 2020
  write: io=8192.0MB, bw=1162.7MB/s, iops=37204, runt=  7046msec
    slat (usec): min=3, max=23045, avg=10.37, stdev=105.32
    clat (usec): min=1, max=5479, avg=93.46, stdev=99.55
     lat (usec): min=36, max=23127, avg=104.25, stdev=145.57
    clat percentiles (usec):
     |  1.00th=[   45],  5.00th=[   63], 10.00th=[   86], 20.00th=[   88],
     | 30.00th=[   89], 40.00th=[   90], 50.00th=[   91], 60.00th=[   91],
     | 70.00th=[   92], 80.00th=[   93], 90.00th=[   94], 95.00th=[   99],
     | 99.00th=[  109], 99.50th=[  110], 99.90th=[ 2096], 99.95th=[ 2160],
     | 99.99th=[ 2832]
    bw (KB  /s): min=275840, max=313024, per=25.35%, avg=301851.77, stdev=7276.35
    lat (usec) : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=2.13%
    lat (usec) : 100=92.99%, 250=4.63%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.20%, 10=0.01%
  cpu          : usr=2.70%, sys=12.71%, ctx=262340, majf=0, minf=48
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=262144/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=8192.0MB, aggrb=1162.7MB/s, minb=1162.7MB/s, maxb=1162.7MB/s, mint=7046msec, maxt=7046msec

Disk stats (read/write):
  nvme0n1: ios=58/259296, merge=0/0, ticks=0/24984, in_queue=8400, util=81.64%