benchmarks/fio_nvme_latency_checks/output/seqread.out
seqread: (g=0): rw=read, bs=32K-32K/32K-32K/32K-32K, ioengine=libaio, iodepth=1
...
fio-2.2.10
Starting 4 processes
Jobs: 3 (f=3): [R(2),_(1),R(1)] [100.0% done] [757.6MB/0KB/0KB /s] [24.3K/0/0 iops] [eta 00m:00s]
seqread: (groupid=0, jobs=4): err= 0: pid=2068: Thu Jul  2 23:22:51 2020
  read : io=8192.0MB, bw=799905KB/s, iops=24997, runt= 10487msec
    slat (usec): min=2, max=2482, avg= 4.33, stdev=14.67
    clat (usec): min=1, max=2085, avg=145.99, stdev=47.25
     lat (usec): min=49, max=3103, avg=150.72, stdev=49.90
    clat percentiles (usec):
     |  1.00th=[  110],  5.00th=[  112], 10.00th=[  112], 20.00th=[  113],
     | 30.00th=[  114], 40.00th=[  119], 50.00th=[  151], 60.00th=[  153],
     | 70.00th=[  155], 80.00th=[  191], 90.00th=[  193], 95.00th=[  193],
     | 99.00th=[  195], 99.50th=[  197], 99.90th=[  207], 99.95th=[  684],
     | 99.99th=[ 2008]
    bw (KB  /s): min=178496, max=266496, per=26.00%, avg=208011.64, stdev=32440.93
    lat (usec) : 2=0.01%, 4=0.01%, 10=0.01%, 50=0.05%, 100=0.53%
    lat (usec) : 250=99.32%, 500=0.02%, 750=0.03%, 1000=0.01%
    lat (msec) : 2=0.03%, 4=0.01%
  cpu          : usr=1.56%, sys=5.20%, ctx=262463, majf=0, minf=79
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=262144/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=8192.0MB, aggrb=799905KB/s, minb=799905KB/s, maxb=799905KB/s, mint=10487msec, maxt=10487msec

Disk stats (read/write):
  nvme0n1: ios=260264/0, merge=0/0, ticks=37516/0, in_queue=21984, util=96.35%